DataProcessors/CRM_АРМ_АвтоСервис_4.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>CRM_АРМ_АвтоСервис_4</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисСтатусыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисСтатусыРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремяИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СтатусыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипПаузы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_АвтосервисВидыПрочейЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПростой</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПрочаяЗанятость</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисОбед</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисПланОперативный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисПланОперативный</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисПланРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисПланРабот</Name>
			<Comment>Регистр хранения планов работ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>versionID</Name>
					<Comment>Скрытый реквизит, автоматически генерирует номер версии при записи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>strID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПростой</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПрочаяЗанятость</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисОбед</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисФактОперативный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисФактОперативный</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_ВидыМашиноместВЦеху.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ВидыМашиноместВЦеху</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мойка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиноместоВЦеху</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МастерПриемщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодменныйАвтомобиль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/CRM_АРМ_АвтоСервис_4/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуЗакраски(ДилерскийЦентр, НачалоРабочегоДня, КонецРабочегоДня, ШагПланирования, 
								ТаблицаМашиномест, НаправлениеЗакраскиЛевоПраво, 
								ОкрашиватьДругимиПользователями = Ложь, 
								ПользовательПоУмолчанию = Неопределено) Экспорт
	
	Если ПользовательПоУмолчанию = Неопределено Тогда 
		ПользовательПоУмолчанию = Справочники.Пользователи.ПустаяСсылка(); 
	КонецЕсли;
	
	//В эту таблицу все и запишем
	ТаблицаЗакраска = Новый ТаблицаЗначений;
	ТаблицаЗакраска.Колонки.Добавить("Цвет");
	ТаблицаЗакраска.Колонки.Добавить("Обращение", Документы.ТипВсеСсылки());
	ТаблицаЗакраска.Колонки.Добавить("РабочийДокумент");
	ТаблицаЗакраска.Колонки.Добавить("Цех");
	ТаблицаЗакраска.Колонки.Добавить("Машиноместо");
	ТаблицаЗакраска.Колонки.Добавить("ВремяНачала");
	ТаблицаЗакраска.Колонки.Добавить("ВремяОкончания");
	ТаблицаЗакраска.Колонки.Добавить("Узор");
	ТаблицаЗакраска.Колонки.Добавить("Клиент");
	ТаблицаЗакраска.Колонки.Добавить("ЭтапРабот");
	ТаблицаЗакраска.Колонки.Добавить("ВремяНачалаРег");
	ТаблицаЗакраска.Колонки.Добавить("ВремяОкончанияРег");
	ТаблицаЗакраска.Колонки.Добавить("Статус");
	ТаблицаЗакраска.Колонки.Добавить("ТипПаузы");
	ТаблицаЗакраска.Колонки.Добавить("Жалоба");
	ТаблицаЗакраска.Колонки.Добавить("Модель");	
	ТаблицаЗакраска.Колонки.Добавить("ГосНомер");
	ТаблицаЗакраска.Колонки.Добавить("Примечание");
			
	ТаблицаЗакраска.Индексы.Добавить("Обращение, РабочийДокумент, Цех, ВремяНачала, ВремяОкончания, Клиент, ВремяНачалаРег, ВремяОкончанияРег");
	
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("НачалоДня", НачалоРабочегоДня);
	Запрос.УстановитьПараметр("КонецДня", КонецРабочегоДня);
	Запрос.УстановитьПараметр("ТаблицаМашиномест", ТаблицаМашиномест);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//Запрос.УстановитьПараметр("ЦветФона", Новый Цвет(0,0,0));
	Запрос.УстановитьПараметр("Узор15", ТипУзораТабличногоДокумента.Узор15);
	Запрос.УстановитьПараметр("Узор17", ТипУзораТабличногоДокумента.Узор17);
	Запрос.УстановитьПараметр("БезУзора", ТипУзораТабличногоДокумента.БезУзора);
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Т.Машиноместо КАК Машиноместо,
	|	Т.НомерПоста КАК НомерПоста
	|ПОМЕСТИТЬ втПосты
	|ИЗ
	|	&ТаблицаМашиномест КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Машиноместо,
	|	НомерПоста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыРабот.Обращение КАК Обращение,
	|	СтатусыРабот.РабочийДокумент КАК РабочийДокумент,
	|	СтатусыРабот.Цех КАК Цех,
	|	СтатусыРабот.ЭтапРабот КАК ЭтапРабот,
	|	СтатусыРабот.СтатусРаботы КАК СтатусРаботы,
	|	СтатусыРабот.ТипПаузы КАК ТипПаузы,
	|	втПосты.НомерПоста КАК НомерПоста
	|ПОМЕСТИТЬ ВтСтатусыРабот
	|ИЗ
	|	втПосты КАК втПосты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних(&ТекущаяДата, ДилерскийЦентр = &ДилерскийЦентр) КАК СтатусыРабот
	|		ПО втПосты.Машиноместо = СтатусыРабот.Цех
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Обращение,
	|	РабочийДокумент,
	|	Цех,
	|	ЭтапРабот,
	|	СтатусРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланОперативный.Период КАК Период,
	|	ПланОперативный.Обращение КАК Обращение,
	|	ПланОперативный.РабочийДокумент КАК РабочийДокумент,
	|	ПланОперативный.ЭтапРабот КАК ЭтапРабот,
	|	ПланОперативный.Цех КАК Цех,
	|	ПланОперативный.ВремяНачала КАК ВремяНачала,
	|	ПланОперативный.ВремяОкончания КАК ВремяОкончания,
	|	втПосты.Машиноместо КАК Машиноместо,
	|	втПосты.НомерПоста КАК НомерПоста
	|ПОМЕСТИТЬ ВтПланОперативный
	|ИЗ
	|	втПосты КАК втПосты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланОперативный.СрезПоследних(&ТекущаяДата, ДилерскийЦентр = &ДилерскийЦентр) КАК ПланОперативный
	|		ПО втПосты.Машиноместо = ПланОперативный.Цех
	|			И (ПланОперативный.ВремяНачала <= &КонецДня)
	|			И (ПланОперативный.ВремяОкончания >= &НачалоДня)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Обращение,
	|	РабочийДокумент,
	|	Цех,
	|	ЭтапРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Пакет,
	|	втПосты.НомерПоста КАК НомерПоста,
	|	ПланРабот.Обращение КАК Обращение,
	|	ПланРабот.РабочийДокумент КАК РабочийДокумент,
	|	ПланРабот.Цех КАК Цех,
	|	ПланРабот.ЭтапРабот КАК ЭтапРабот,
	|	ПланРабот.ВремяНачала КАК ВремяНачала,
	|	ПланРабот.ВремяОкончания КАК ВремяОкончания,
	|	ЕСТЬNULL(СтатусыРабот.СтатусРаботы, ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаЗапланирована)) КАК СтатусРаботы,
	|	СтатусыРабот.ТипПаузы КАК ТипПаузы
	|ПОМЕСТИТЬ ЗП
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисПланРабот КАК ПланРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПосты КАК втПосты
	|		ПО ПланРабот.ДилерскийЦентр = &ДилерскийЦентр
	|			И ПланРабот.Цех = втПосты.Машиноместо
	|			И ПланРабот.ВремяНачала <= &КонецДня
	|			И ПланРабот.ВремяОкончания >= &НачалоДня
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтатусыРабот КАК СтатусыРабот
	|		ПО  ПланРабот.Обращение = СтатусыРабот.Обращение
	|			И ПланРабот.РабочийДокумент = СтатусыРабот.РабочийДокумент
	|			И ПланРабот.Цех = СтатусыРабот.Цех
	|			И ПланРабот.ЭтапРабот = СтатусыРабот.ЭтапРабот
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВтПланОперативный.НомерПоста,
	|	ВтПланОперативный.Обращение,
	|	ВтПланОперативный.РабочийДокумент,
	|	ВтПланОперативный.Цех,
	|	ВтПланОперативный.ЭтапРабот,
	|	ВтПланОперативный.ВремяНачала,
	|	ВтПланОперативный.ВремяОкончания,
	|	ВтСтатусыРабот.СтатусРаботы,
	|	ВтСтатусыРабот.ТипПаузы
	|ИЗ
	|	ВтПланОперативный КАК ВтПланОперативный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСтатусыРабот КАК ВтСтатусыРабот
	|		ПО ВтПланОперативный.Обращение = ВтСтатусыРабот.Обращение
	|			И ВтПланОперативный.РабочийДокумент = ВтСтатусыРабот.РабочийДокумент
	|			И ВтПланОперативный.Цех = ВтСтатусыРабот.Цех
	|			И ВтПланОперативный.ЭтапРабот = ВтСтатусыРабот.ЭтапРабот
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3,
	|	втПосты.НомерПоста,
	|	ФактОперативный.Обращение,
	|	ФактОперативный.РабочийДокумент,
	|	ФактОперативный.Цех,
	|	ФактОперативный.ЭтапРабот,
	|	ФактОперативный.ВремяНачала,
	|	ФактОперативный.ВремяОкончания,
	|	СтатусыРабот.СтатусРаботы,
	|	СтатусыРабот.ТипПаузы
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисФактОперативный КАК ФактОперативный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтатусыРабот КАК СтатусыРабот
	|		ПО ФактОперативный.Обращение = СтатусыРабот.Обращение
	|			И ФактОперативный.РабочийДокумент = СтатусыРабот.РабочийДокумент
	|			И ФактОперативный.ЭтапРабот = СтатусыРабот.ЭтапРабот
	|			И ФактОперативный.Цех = СтатусыРабот.Цех
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПосты КАК втПосты
	|		ПО ФактОперативный.Цех = втПосты.Машиноместо
	|ГДЕ
	|	ФактОперативный.ВремяНачала <= &КонецДня
	|	И ФактОперативный.ВремяОкончания >= &НачалоДня
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Обращение,
	|	ВремяНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗП.РабочийДокумент,
	|	ЗП.НомерПоста КАК Цех,
	|	ЗП.Цех КАК Машиноместо,
	|	ЗП.ЭтапРабот,
	|	ЗП.ВремяНачала КАК ВремяНачалаРег,
	|	ЗП.ВремяОкончания КАК ВремяОкончанияРег,
	|	ЗП.СтатусРаботы КАК Статус,
	|	ЗП.ТипПаузы,
	|	ВЫБОР
	|		КОГДА ЗП.ВремяНачала > &НачалоДня
	|			ТОГДА ЗП.ВремяНачала
	|		ИНАЧЕ &НачалоДня
	|	КОНЕЦ КАК ВремяНачала,
	|	ЗП.ВремяОкончания,
	|	ВЫБОР
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаОбед)
	|			ТОГДА ЗП.РабочийДокумент
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПростой)
	|			ТОГДА ЗП.РабочийДокумент
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПрочаяЗанятость)
	|			ТОГДА ЗП.РабочийДокумент
	|		ИНАЧЕ ЗП.Обращение
	|	КОНЕЦ КАК Обращение,
	|	ВЫБОР
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаОбед)
	|			ТОГДА ""ЦветРаботыОбед""
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПростой)
	|			ТОГДА ""ЦветРаботыПростой""
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПрочаяЗанятость)
	|			ТОГДА ""ЦветРаботыПростой""
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаЗапланирована)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗП.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ВыдачаАвтомобиля
	|						ТОГДА ""ЦветЗапланированнойВыдачи""
	|					ИНАЧЕ ""ЦветЗапланированнойРаботы""
	|				КОНЕЦ
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПросрочена)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗП.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ВыдачаАвтомобиля
	|						ТОГДА ""ЦветПросроченнойВыдачи""
	|					ИНАЧЕ ""ЦветПросроченнойРаботы""
	|				КОНЕЦ
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаНачата)
	|				И ЗП.Пакет = 3
	|			ТОГДА ""ЦветАктивнойРаботыФакт""
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаНачата)
	|			ТОГДА ""ЦветАктивнойРаботыПлан""
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПауза)
	|			ТОГДА ""ЦветПриостановленнойРаботы""
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаЗакончена)
	|			ТОГДА ""ЦветЗаконченойРаботы""
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЦветФона,
	|	ВЫБОР
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаОбед)
	|			ТОГДА &Узор15
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПростой)
	|			ТОГДА &Узор17
	|		ИНАЧЕ &БезУзора
	|	КОНЕЦ КАК Узор,
	|	ВЫБОР
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаЗапланирована)
	|			ТОГДА ЗП.Обращение.Клиент
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПросрочена)
	|			ТОГДА ЗП.Обращение.Клиент
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаНачата)
	|			ТОГДА ЗП.Обращение.Клиент
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПауза)
	|			ТОГДА ЗП.Обращение.Клиент
	|		КОГДА ЗП.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаЗакончена)
	|			ТОГДА ЗП.Обращение.Клиент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Клиент,
	|	ЗП.Обращение.Автомобиль.Модель КАК Модель,
	|	ЕСТЬNULL(ЗП.Обращение.Жалоба, ЛОЖЬ) КАК Жалоба,
	|	АвтомобилиСрезПоследних.Значение КАК ГосНомер,
	|	ЗП.Обращение.Примечание КАК Примечание,
	|	ЗП.Пакет КАК Пакет
	|ИЗ
	|	ЗП КАК ЗП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&ТекущаяДата, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК АвтомобилиСрезПоследних
	|		ПО ЗП.Обращение.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяНачала " + ?(НаправлениеЗакраскиЛевоПраво," Убыв"," Возр");
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивУдаления = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаЗакраски = ТаблицаЗакраска.НайтиСтроки(Новый Структура("Обращение, РабочийДокумент, ЭтапРабот", Выборка.Обращение, Выборка.РабочийДокумент, Выборка.ЭтапРабот));
		
		Если СтрокаЗакраски.Количество() = 0 Тогда
			НоваяСтрока=ТаблицаЗакраска.Добавить();
		Иначе
			Если Выборка.Статус <> Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована Тогда 
				НоваяСтрока = СтрокаЗакраски[0];
				//+++
			Иначе 
				НоваяСтрока = ТаблицаЗакраска.Добавить();
				//---
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.Пакет = 3 И НачалоДня(Выборка.ВремяОкончания) < НачалоДня(НачалоРабочегоДня) Тогда
			МассивУдаления.Добавить(НоваяСтрока);
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		
		ЦветФона = ?(Выборка.ЦветФона = NULL, "", Выборка.ЦветФона);

		//НоваяСтрока.Цвет=?(ОкрашиватьДругимиПользователями, Renault_АвтосервисПланирование.Renault_ОкраситьДругимПользователем(ЦветФона, Выборка.РабочийДокумент, ПользовательПоУмолчанию), ЦветФона);
		НоваяСтрока.Цвет = ЦветФона;
		
		ВремяОкончания = Мин(КонецРабочегоДня,Выборка.ВремяОкончания);
		
		ИнтерваловСНачалаДня = (ВремяОкончания - НачалоРабочегоДня) / (ШагПланирования * 60);
		Если Цел(ИнтерваловСНачалаДня) <> ИнтерваловСНачалаДня Тогда
			ИнтерваловСНачалаДня = Цел(ИнтерваловСНачалаДня) + 1;
		КонецЕсли;
		ВремяОкончания = НачалоРабочегоДня + ИнтерваловСНачалаДня * (ШагПланирования * 60);
		НоваяСтрока.ВремяОкончания = ВремяОкончания;
		
		Если Выборка.Статус = Справочники.Renault_СтатусыАвторабот.РаботаНачата
			И Выборка.ВремяНачалаРег < ТекущаяДата() И Выборка.ВремяОкончанияРег < ТекущаяДата() Тогда
			НоваяСтрока.ВремяОкончанияРег = ТекущаяДата();
		КонецЕсли; 
	КонецЦикла;
	
	Для Каждого Строка Из МассивУдаления Цикл
		ТаблицаЗакраска.Удалить(Строка);
	КонецЦикла;
	
	Возврат ТаблицаЗакраска;
	
КонецФункции

Функция ПолучитьТаблицуЗакраскиАрхив(ДилерскийЦентр, НачалоРабочегоДня, КонецРабочегоДня, ШагПланирования, 
										ТаблицаМашиномест, НаправлениеЗакраскиЛевоПраво, 										
										ОкрашиватьДругимиПользователями = Ложь, 
										ПользовательПоУмолчанию = Неопределено) Экспорт
	
	Если ПользовательПоУмолчанию = Неопределено Тогда		
		ПользовательПоУмолчанию = Справочники.Пользователи.ПустаяСсылка();		
	КонецЕсли;
	
	//В эту таблицу все и запишем
	ТаблицаЗакраска = Новый ТаблицаЗначений();
	ТаблицаЗакраска.Колонки.Добавить("Цвет");
	ТаблицаЗакраска.Колонки.Добавить("Обращение", Документы.ТипВсеСсылки());
	ТаблицаЗакраска.Колонки.Добавить("РабочийДокумент");
	ТаблицаЗакраска.Колонки.Добавить("Цех");
	ТаблицаЗакраска.Колонки.Добавить("ВремяНачала");
	ТаблицаЗакраска.Колонки.Добавить("ВремяОкончания");
	ТаблицаЗакраска.Колонки.Добавить("Узор");
	ТаблицаЗакраска.Колонки.Добавить("Клиент");
	ТаблицаЗакраска.Колонки.Добавить("ЭтапРабот");
	ТаблицаЗакраска.Колонки.Добавить("ВремяНачалаРег");
	ТаблицаЗакраска.Колонки.Добавить("ВремяОкончанияРег");
	ТаблицаЗакраска.Колонки.Добавить("Статус");
	ТаблицаЗакраска.Колонки.Добавить("Модель");
	ТаблицаЗакраска.Колонки.Добавить("ГосНомер");
	ТаблицаЗакраска.Колонки.Добавить("Жалоба");
	ТаблицаЗакраска.Колонки.Добавить("Машиноместо");
	//ТаблицаЗакраска.Колонки.Добавить("ТипПаузы");
	ТаблицаЗакраска.Колонки.Добавить("Примечание");	
	ТаблицаЗакраска.Индексы.Добавить("Обращение, РабочийДокумент, Цех, ВремяНачала, ВремяОкончания, Клиент, ВремяНачалаРег, ВремяОкончанияРег");
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вт_Посты.Машиноместо КАК Машиноместо,
	|	вт_Посты.НомерПоста
	|ПОМЕСТИТЬ вт_Посты
	|ИЗ
	|	&ВтПосты КАК вт_Посты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Машиноместо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_АвтосервисПланРабот.Обращение,
	|	Renault_АвтосервисПланРабот.Обращение.Примечание КАК Примечание,
	|	Renault_АвтосервисПланРабот.РабочийДокумент,
	|	Renault_АвтосервисПланРабот.Цех КАК Цех,
	|	Renault_АвтосервисПланРабот.Цех КАК Машиноместо,
	|	Renault_АвтосервисПланРабот.ЭтапРабот,
	|	Renault_АвтосервисПланРабот.ВремяНачала,
	|	Renault_АвтосервисПланРабот.ВремяОкончания,
	|	Renault_АвтосервисПланРабот.ВремяНачала КАК ВремяНачалаРег,
	|	Renault_АвтосервисПланРабот.ВремяОкончания КАК ВремяОкончанияРег,
	|	Renault_АвтосервисПланРабот.Длительность,
	|	ЕСТЬNULL(Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы, ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаЗапланирована)) КАК СтатусРаботы,
	|	Renault_АвтосервисСтатусыРаботСрезПоследних.ТипПаузы КАК ТипПаузы,
	|	вт_ПОСТЫ.НомерПоста,
	|	ЕСТЬNULL(Renault_АвтосервисПланРабот.Обращение.Жалоба, ЛОЖЬ) КАК Жалоба,
	|	Renault_АвтосервисПланРабот.Обращение.Автомобиль.Модель КАК Модель,
	|	АвтомобилиСрезПоследних.Значение КАК ГосНомер
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК Renault_АвтосервисСтатусыРаботСрезПоследних
	|		ПО Renault_АвтосервисПланРабот.ДилерскийЦентр = Renault_АвтосервисСтатусыРаботСрезПоследних.ДилерскийЦентр
	|			И Renault_АвтосервисПланРабот.Обращение = Renault_АвтосервисСтатусыРаботСрезПоследних.Обращение
	|			И Renault_АвтосервисПланРабот.РабочийДокумент = Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент
	|			И Renault_АвтосервисПланРабот.Цех = Renault_АвтосервисСтатусыРаботСрезПоследних.Цех
	|			И Renault_АвтосервисПланРабот.ЭтапРабот = Renault_АвтосервисСтатусыРаботСрезПоследних.ЭтапРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Посты КАК вт_ПОСТЫ
	|		ПО Renault_АвтосервисПланРабот.Цех = вт_ПОСТЫ.Машиноместо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК АвтомобилиСрезПоследних
	|		ПО Renault_АвтосервисПланРабот.Обращение.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|ГДЕ
	|	Renault_АвтосервисПланРабот.ДилерскийЦентр = &ДилерскийЦентр
	|	И Renault_АвтосервисПланРабот.ВремяНачала <= &КонецДня
	|	И Renault_АвтосервисПланРабот.ВремяОкончания > &НачалоДня
	|{УПОРЯДОЧИТЬ ПО
	|	ВремяОкончания}";
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("НачалоДня", НачалоРабочегоДня);
	Запрос.УстановитьПараметр("КонецДня", КонецРабочегоДня);
	Запрос.УстановитьПараметр("ВтПосты", ТаблицаМашиномест);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Обращение = Неопределено;
		Узор = Неопределено;
		ЦветФона = Неопределено;
		Клиент = Неопределено;
		
		Если Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаОбед Тогда
			
			ЦветФона = "ЦветРаботыОбед";
			Обращение = Выборка.РабочийДокумент;
			Узор = ТипУзораТабличногоДокумента.Узор15;			
			Клиент = Неопределено;
			
		ИначеЕсли Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПростой Тогда
			
			ЦветФона = "ЦветРаботыПростой";
			Обращение = Выборка.РабочийДокумент;
			Узор = ТипУзораТабличногоДокумента.Узор17;			
			Клиент = Неопределено;
			
		ИначеЕсли Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПрочаяЗанятость Тогда
			
			ЦветФона = "ЦветРаботыПростой";
			Обращение = Выборка.РабочийДокумент;
			Клиент = Неопределено;
			
		ИначеЕсли Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована Тогда
			
			ЦветФона = "ЦветЗапланированнойРаботы";
			Обращение = Выборка.Обращение;
			Узор = ТипУзораТабличногоДокумента.БезУзора;
			Клиент = Выборка.Обращение.Клиент;
			Если ЗначениеЗаполнено(Выборка.РабочийДокумент) 
				И ТипЗнч(Выборка.РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
				ЦветФона = "ЦветЗапланированнойВыдачи";				
			КонецЕсли;
			
		ИначеЕсли Выборка.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена Тогда
			
			ЦветФона = "ЦветПросроченнойРаботы";	
			Обращение = Выборка.Обращение;
			Узор = ТипУзораТабличногоДокумента.БезУзора;
			Клиент = Выборка.Обращение.Клиент;		
			Если ЗначениеЗаполнено(Выборка.РабочийДокумент) 
				И ТипЗнч(Выборка.РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
				ЦветФона = "ЦветПросроченнойВыдачи";
			КонецЕсли;
			
		Иначе
			
			ЦветФона = "ЦветПросроченнойРаботы";		
			Обращение = Выборка.Обращение;
			Узор = ТипУзораТабличногоДокумента.БезУзора;
			Клиент = Выборка.Обращение.Клиент;		
			Если ЗначениеЗаполнено(Выборка.РабочийДокумент) 
				И ТипЗнч(Выборка.РабочийДокумент) = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
				ЦветФона = "ЦветПросроченнойВыдачи";
			КонецЕсли;
			
			//ЦветФона = "ЦветЗапланированнойРаботы";			
		КонецЕсли;
		
		ВремяНачала = Неопределено;
		ВремяОкончания = Неопределено;
		
		Если Выборка.ВремяНачала < НачалоРабочегоДня Тогда			
			ВремяНачала = НачалоРабочегоДня;			
		Иначе			
			ВремяНачала = Выборка.ВремяНачала;			
		КонецЕсли;		
		
		Если Выборка.ВремяОкончания > КонецРабочегоДня Тогда			
			ВремяОкончания = КонецРабочегоДня;				
		Иначе			
			ВремяОкончания = Выборка.ВремяОкончания;			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗакраска.Добавить();
		
		//Если ОкрашиватьДругимиПользователями Тогда			
		//	НоваяСтрока.Цвет = Renault_ОкраситьДругимПользователем(ЦветФона, Выборка.РабочийДокумент, ПользовательПоУмолчанию);
		//Иначе
			НоваяСтрока.Цвет = ЦветФона;
		//КонецЕсли;
		
		НоваяСтрока.Цех = Выборка.НомерПоста;
		НоваяСтрока.Машиноместо = Выборка.Машиноместо;
		НоваяСтрока.ВремяНачала = ВремяНачала;
		//НоваяСтрока.ВремяОкончания = ВремяОкончания;
		ИнтерваловСНачалаДня = (ВремяОкончания - НачалоДня(ВремяОкончания)) / (ШагПланирования * 60);
		Если Цел(ИнтерваловСНачалаДня) <> ИнтерваловСНачалаДня Тогда
			ИнтерваловСНачалаДня = Цел(ИнтерваловСНачалаДня) + 1;
		КонецЕсли;
		ВремяОкончания = НачалоДня(ВремяОкончания) + ИнтерваловСНачалаДня * (ШагПланирования * 60);
		НоваяСтрока.ВремяОкончания = ВремяОкончания;
		НоваяСтрока.Обращение = Обращение;
		НоваяСтрока.РабочийДокумент = Выборка.РабочийДокумент;
		НоваяСтрока.Узор = Узор;
		НоваяСтрока.Клиент = Клиент;
		НоваяСтрока.ЭтапРабот = Выборка.ЭтапРабот;
		НоваяСтрока.ВремяНачалаРег = Выборка.ВремяНачала;
		НоваяСтрока.ВремяОкончанияРег = Выборка.ВремяОкончания;
		НоваяСтрока.Статус = Выборка.СтатусРаботы;
		НоваяСтрока.Жалоба = Выборка.Жалоба;
		НоваяСтрока.Госномер = Выборка.Госномер;
		НоваяСтрока.Модель = Выборка.Модель;
		НоваяСтрока.Примечание = Выборка.Примечание;
		
	КонецЦикла;
	
	ТаблицаЗакраска.Сортировать("ВремяНачала " + ?(НаправлениеЗакраскиЛевоПраво, "Убыв", "Возр"));
	
	Возврат ТаблицаЗакраска;
	
КонецФункции

Функция ПолучитьТаблицуМашиномест(ДилерскийЦентр, НачалоРабочегоДня, КонецРабочегоДня, ВыделятьСебя, 
									ТолькоРаботающие, ОтборМашиноместо, ОтборВидМашиноместа, Сотрудник) Экспорт
	
	ПодразделенияДЦ   = Справочники.CRM_ДилерскиеЦентры.ПолучитьПодразделенияДЦ(ДилерскийЦентр).ВыгрузитьКолонку("Подразделение");
	ДолжностиПриемки = Справочники.CRM_ДилерскиеЦентры.ПолучитьДолжностиАвтосервиса(ДилерскийЦентр).ВыгрузитьКолонку("Должность");
	
	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("ВыделятьСебя",	  ВыделятьСебя);
	Запрос.УстановитьПараметр("ТекПриемщик", 	  Сотрудник);
	Запрос.УстановитьПараметр("ВидМашиноместа",	  ОтборВидМашиноместа);	
	Запрос.УстановитьПараметр("ОтборДата", 		  НачалоРабочегоДня);
	Запрос.УстановитьПараметр("НачалоДня", 		  НачалоРабочегоДня);
	Запрос.УстановитьПараметр("КонецДня", 		  КонецРабочегоДня);
	Запрос.УстановитьПараметр("ДилерскийЦентр",   ДилерскийЦентр);			
	Запрос.УстановитьПараметр("ПодразделенияДЦ", ПодразделенияДЦ);
	Запрос.УстановитьПараметр("ДолжностиПриемки", ДолжностиПриемки);
	
	Если ЗначениеЗаполнено(ОтборМашиноместо) Тогда
		Запрос.УстановитьПараметр("Машиноместо", ОтборМашиноместо);
		Запрос.УстановитьПараметр("МашиноместоЗаполнено", Истина);
	Иначе
		Запрос.УстановитьПараметр("Машиноместо", Справочники.Цеха.ПустаяСсылка());
		Запрос.УстановитьПараметр("МашиноместоЗаполнено", Ложь);
	КонецЕсли;
	
	
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦехаАвтосервиса.Цех КАК Ссылка,
	|	ЦехаАвтосервиса.КоэффициентЗагрузки КАК КоэффициентЗагрузки,
	|	2 КАК ВидМашиноместа,
	|	ЦехаАвтосервиса.НомерСтроки,
	|	ЦехаАвтосервиса.ЦветФонаСтроки
	|ПОМЕСТИТЬ Машиноместа
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК ЦехаАвтосервиса
	|ГДЕ
	|	НЕ ЦехаАвтосервиса.Ссылка.ПометкаУдаления
	|	И ЦехаАвтосервиса.Ссылка.Ссылка = &ДилерскийЦентр
	|	И (&ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.МашиноместоВЦеху)
	|			ИЛИ &ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МойкиАвтосервиса.Мойка,
	|	0,
	|	1,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры.АвтосервисМойки КАК МойкиАвтосервиса
	|ГДЕ
	|	НЕ МойкиАвтосервиса.Ссылка.ПометкаУдаления
	|	И МойкиАвтосервиса.Ссылка.Ссылка = &ДилерскийЦентр
	|	И (&ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.Мойка)
	|			ИЛИ &ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодменныеАвтоАвтосервиса.Авто,
	|	0,
	|	4,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры.АвтосервисПодменныеАвто КАК ПодменныеАвтоАвтосервиса
	|ГДЕ
	|	НЕ ПодменныеАвтоАвтосервиса.Ссылка.ПометкаУдаления
	|	И ПодменныеАвтоАвтосервиса.Ссылка.Ссылка = &ДилерскийЦентр
	|	И (&ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.ПодменныйАвтомобиль)
	|			ИЛИ &ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка,
	|	0,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	(&ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.МастерПриемщик)
	|			ИЛИ &ВидМашиноместа = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыМашиноместВЦеху.ПустаяСсылка))
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И Сотрудники.Должность В(&ДолжностиПриемки)
	|	И Сотрудники.Подразделение В(&ПодразделенияДЦ)
	|	И НЕ Сотрудники.ФлагУволен
	|	И (НЕ &ВыделятьСебя
	|			ИЛИ Сотрудники.Ссылка = &ТекПриемщик)
	|{УПОРЯДОЧИТЬ ПО
	|	НомерСтроки}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидМашиноместа,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланРаботАвтосервиса.Цех КАК Цех,
	|	СУММА(ПланРаботАвтосервиса.Длительность) КАК Длительность,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПланРаботАвтосервиса.Обращение) КАК КоличествоОбращений
	|ПОМЕСТИТЬ Работы
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисПланРабот КАК ПланРаботАвтосервиса
	|ГДЕ
	//|	НАЧАЛОПЕРИОДА(ПланРаботАвтосервиса.ВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ОтборДата, ДЕНЬ)
	|	ПланРаботАвтосервиса.ВремяНачала < &КонецДня 
	|	И ПланРаботАвтосервиса.ВремяОкончания > &НачалоДня 
	|	И НЕ ПланРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисОбед
	|	И НЕ ПланРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисПростой
	|	И НЕ ПланРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисПрочаяЗанятость
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланРаботАвтосервиса.Цех
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Цех
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Машиноместа.Ссылка КАК Машиноместо,
	|	Машиноместа.ВидМашиноместа КАК ВидМашиноместа,
	|	0 КАК НомерПоста,
	|	ЕСТЬNULL(Работы.Длительность, 0) КАК ОбщаяЗанятость,
	|	ЕСТЬNULL(Работы.КоличествоОбращений, 0) КАК КоличествоОбращений,
	|	Машиноместа.КоэффициентЗагрузки КАК КоэффициентЗагрузки,
	|	ЛОЖЬ КАК Работает,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоРаботы,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КонецРаботы,
	|	Машиноместа.НомерСтроки КАК НомерСтроки,
	|	Машиноместа.ЦветФонаСтроки
	|ИЗ
	|	Машиноместа КАК Машиноместа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Работы КАК Работы
	|		ПО Машиноместа.Ссылка = Работы.Цех
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &МашиноместоЗаполнено
	|		ТОГДА Машиноместа.Ссылка = &Машиноместо
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	ВидМашиноместа,
	|	НомерСтроки,
	|	Машиноместо
	|АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаМашиноместа = Запрос.Выполнить().Выгрузить();	
	ТаблицаМашиноместа.Индексы.Добавить("Машиноместо,НомерПоста");
	
	НомерПоста = 1;
	
	Для Каждого Строка Из ТаблицаМашиноместа Цикл
		
		Строка.НомерПоста = НомерПоста;
		НомерПоста = НомерПоста + 1;
		
	КонецЦикла;
	
	ТаблицаМашиноместа.Индексы.Добавить("Машиноместо, НомерПоста");
	
	ТаблицаМашиноместа.Колонки.Добавить("ТЗ", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Для Каждого Строка Из ТаблицаМашиноместа Цикл

		Если Строка.ВидМашиноместа = 0 Тогда
			
			Работает = ПолучитьИсполнителейЗаПериод(НачалоРабочегоДня, КонецРабочегоДня, Строка.Машиноместо, Неопределено);
			
			Если ЗначениеЗаполнено(Работает) Тогда
				
				Строка.Работает = ИСТИНА;
				Строка.НачалоРаботы = Работает[0].НачалоРаботы;
				Строка.КонецРаботы = Работает[0].КонецРаботы;
				Строка.ТЗ = Работает;
				
			Иначе
				
				Строка.Работает = ЛОЖЬ;
				Строка.ТЗ = Работает;
				
			КонецЕсли;
			
		ИначеЕсли Строка.ВидМашиноместа = 2 Тогда
			
			Если ДилерскийЦентр.Автосервис_НеИспользоватьГрафикЦехов = Ложь Тогда
				
				Работает = ПолучитьИсполнителейЗаПериод(НачалоРабочегоДня, КонецРабочегоДня, Неопределено, Строка.Машиноместо);
				
				Если ЗначениеЗаполнено(Работает) Тогда
					
					Строка.Работает = ИСТИНА;
					Строка.НачалоРаботы = Работает[0].НачалоРаботы;
					Строка.КонецРаботы = Работает[0].КонецРаботы;
					Строка.ТЗ = Работает;
					
				Иначе
					
					Строка.Работает = ЛОЖЬ;
					Строка.ТЗ = Работает;
					
				КонецЕсли;
				
			Иначе
				
				Строка.Работает = ИСТИНА;
				Строка.НачалоРаботы = НачалоРабочегоДня;
				Строка.КонецРаботы = КонецРабочегоДня;
				Строка.ТЗ = Работает;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРезультат = ТаблицаМашиноместа.СкопироватьКолонки();
	
	Если ТолькоРаботающие Тогда
		
		НомерПоста = 1;
		Для Каждого Строка из ТаблицаМашиноместа Цикл			
			Если Строка.Работает ИЛИ Строка.ВидМашиноместа = 1 ИЛИ Строка.ВидМашиноместа = 4 Тогда				
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.НомерПоста = НомерПоста;
				НомерПоста = НомерПоста + 1;				
			КонецЕсли;			
		КонецЦикла;		
	Иначе		
		ТаблицаРезультат = ТаблицаМашиноместа.Скопировать();		
	КонецЕсли;
	

	Если ДилерскийЦентр.ИспользоватьДополнительныеПараметрыСменыАвтосервиса Тогда
		Для Каждого Стр Из ТаблицаРезультат Цикл
			Если Стр.ТЗ.Колонки.Найти("ДопДлительностьРабочегоДня") <> Неопределено Тогда 
				Стр.ТЗ.Колонки.Удалить("ДопДлительностьРабочегоДня") 
			КонецЕсли;
			Стр.ТЗ.Колонки.Добавить("ДопДлительностьРабочегоДня");
			
			Если Стр.ТЗ.Колонки.Найти("ДопПарамСмены")<>Неопределено Тогда 
				Стр.ТЗ.Колонки.Удалить("ДопПарамСмены") 
			КонецЕсли;
			Стр.ТЗ.Колонки.Добавить("ДопПарамСмены");
			
			Для Каждого СтрТЗ Из Стр.ТЗ Цикл
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	Renault_ДополнительныеПараметрыСменыАвтосервиса.ВремяНачала,
				|	Renault_ДополнительныеПараметрыСменыАвтосервиса.ВремяОкончания
				|ИЗ
				|	РегистрСведений.Renault_ДополнительныеПараметрыСменыАвтосервиса КАК Renault_ДополнительныеПараметрыСменыАвтосервиса
				|ГДЕ
				|	Renault_ДополнительныеПараметрыСменыАвтосервиса.ДилерскийЦентр = &ДЦ
				|	И Renault_ДополнительныеПараметрыСменыАвтосервиса.Смена = &Смена");
				Запрос.УстановитьПараметр("ДЦ", ДилерскийЦентр);
				Запрос.УстановитьПараметр("Смена", СтрТЗ.Смена);
				СтрТЗ.ДопПарамСмены = Запрос.Выполнить().Выгрузить();
				СтрТЗ.ДопДлительностьРабочегоДня = 0;
				Для Каждого СтрДоп Из СтрТЗ.ДопПарамСмены Цикл
					РазницаВСекундах = СтрДоп.ВремяОкончания - СтрДоп.ВремяНачала;
					СтрТЗ.ДопДлительностьРабочегоДня = СтрТЗ.ДопДлительностьРабочегоДня + РазницаВСекундах;
				КонецЦикла;
			КонецЦикла;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуЗанятости(ДилерскийЦентр, НачалоРабочегоДня, КонецРабочегоДня) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДилерскийЦентр",	ДилерскийЦентр);
	Запрос.УстановитьПараметр("НачалоОтбора",	НачалоРабочегоДня);
	Запрос.УстановитьПараметр("КонецОтбора",	КонецРабочегоДня);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланРаботАвтосервиса.Цех КАК Цех,
	|	ПланРаботАвтосервиса.ВремяНачала,
	|	ПланРаботАвтосервиса.ВремяОкончания,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(5, 3)) КАК Длительность
	|ПОМЕСТИТЬ ТаблицаДанных
	|ИЗ
	|	РегистрСведений.Renault_АвтосервисПланРабот КАК ПланРаботАвтосервиса
	|ГДЕ
	|	ПланРаботАвтосервиса.ДилерскийЦентр = &ДилерскийЦентр
	|	И ПланРаботАвтосервиса.ВремяНачала < &КонецОтбора
	|	И ПланРаботАвтосервиса.ВремяОкончания > &НачалоОтбора
	|	И НЕ ПланРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисОбед
	|	И НЕ ПланРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисПростой
	|	И НЕ ПланРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисПрочаяЗанятость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Цех
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Цех,
	|	ТаблицаДанных.ВремяНачала,
	|	ТаблицаДанных.ВремяОкончания,
	|	ТаблицаДанных.Длительность
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных";		
	ТаблицаЗанятости = Запрос.Выполнить().Выгрузить();	
	ТаблицаЗанятости.Индексы.Добавить("Цех");
	
	Для Каждого ТекСтрока Из ТаблицаЗанятости Цикл		
		ВремяНач = ТекСтрока.ВремяНачала;
		Если ВремяНач < НачалоРабочегоДня Тогда
			ВремяНач = НачалоРабочегоДня;
		КонецЕсли;
		
		ВремяКон = ТекСтрока.ВремяОкончания;		
		Если ВремяКон > КонецРабочегоДня Тогда
			ВремяКон = КонецРабочегоДня;
		КонецЕсли;
		
		Длит = ДлительностьРабочегоВремени(ДилерскийЦентр, ВремяНач, ВремяКон);		
		ТекСтрока.Длительность = Длит/3600;		
	КонецЦикла;
	
	ТаблицаЗанятости.Свернуть("Цех","Длительность");
	
	Возврат ТаблицаЗанятости;
		
КонецФункции
 
Функция ПолучитьИсполнителейЗаПериод(НачалоПериода, КонецПериода, Исполнитель = Неопределено, Цех = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ГрафикРаботКалендарный.Дата,
	|	ГрафикРаботКалендарный.НачалоРабочегоВремени,
	|	ГрафикРаботКалендарный.КонецРабочегоВремени,
	|	ДОБАВИТЬКДАТЕ(ГрафикРаботКалендарный.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРаботКалендарный.НачалоРабочегоВремени, СЕКУНДА)) КАК НачалоРаботы,
	|	ДОБАВИТЬКДАТЕ(ГрафикРаботКалендарный.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРаботКалендарный.КонецРабочегоВремени, СЕКУНДА)) КАК КонецРаботы,
	|	ГрафикРаботКалендарный.Смена
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботы КАК ГрафикиРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|			ПО (ГрафикРаботКалендарный.График = ГрафикиРаботы.Ссылка)
	|		ПО Сотрудники.ГрафикРаботы = ГрафикиРаботы.Ссылка
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (ГрафикРаботКалендарный.НачалоРабочегоВремени <= &Начало
	|			ИЛИ ГрафикРаботКалендарный.КонецРабочегоВремени >= &Конец
	|			ИЛИ ГрафикРаботКалендарный.НачалоРабочегоВремени >= &Начало
	|				И ГрафикРаботКалендарный.КонецРабочегоВремени <= &Конец)
	|	И ГрафикРаботКалендарный.ВидДня = &Рабочий
	|	И ГрафикРаботКалендарный.ВидИнтервала = &ВидИнтервала";	
	Запрос.УстановитьПараметр("ВидИнтервала", Справочники.ВидыИнтервалов.Работа);
	Запрос.УстановитьПараметр("Рабочий", Перечисления.ВидДня.Рабочий);
	
	Если ЗначениеЗаполнено(Цех) Тогда		
		Запрос.Текст = Запрос.Текст + Символы.ПС +		
			"И Сотрудники.Цех = &Цех";		
		Запрос.УстановитьПараметр("Цех", Цех);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда		
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
			"И Сотрудники.Ссылка = &Исполнитель";		
		Запрос.УстановитьПараметр("Исполнитель", Исполнитель);			
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС + 		
		"УПОРЯДОЧИТЬ ПО НачалоРаботы";
		
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонецПериода));
	
	Начало = Дата(0001, 01, 01, Час(НачалоПериода), Минута(НачалоПериода), Секунда(НачалоПериода));
	Конец = Дата(0001, 01, 01, Час(КонецПериода), Минута(КонецПериода), Секунда(КонецПериода));
	
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	//Если ЗначениеЗаполнено(Таблица) Тогда
	//	
	//	Таблица.Колонки.Добавить("НачалоРаботы", Новый ОписаниеТипов("Дата"));
	//	Таблица.Колонки.Добавить("КонецРаботы", Новый ОписаниеТипов("Дата"));
	//	
	//	Для Каждого Строка из Таблица Цикл
	//					
	//		Строка.НачалоРаботы = Строка.Дата + ЧАС(Строка.НачалоРабочегоВремени)*3600 + Минута(Строка.НачалоРабочегоВремени)*60;
	//		Строка.КонецРаботы = Строка.Дата + ЧАС(Строка.КонецРабочегоВремени)*3600 + Минута(Строка.КонецРабочегоВремени)*60;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	Таблица.Индексы.Добавить("Сотрудник");
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТаблицуНерабочегоВремени(ДилерскийЦентр, НачалоПериода, КонецПериода, ТаблицаМашиномест) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.Машиноместо КАК Цех,
	|	Таб.НомерПоста КАК НомерЦеха
	|ПОМЕСТИТЬ втЦехаБезГрафиков
	|ИЗ
	|	&ТаблицаМашиномест КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втЦехаБезГрафиков.Цех КАК Цех,
	|	втЦехаБезГрафиков.НомерЦеха КАК НомерЦеха,
	|	ВЫБОР
	|		КОГДА втЦехаБезГрафиков.Цех ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ГрафикиСотрудников.ГрафикРаботы
	|		КОГДА втЦехаБезГрафиков.Цех ССЫЛКА Справочник.Цеха
	|			ТОГДА ГрафикиЦехов.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы
	|ПОМЕСТИТЬ втЦеха
	|ИЗ
	|	втЦехаБезГрафиков КАК втЦехаБезГрафиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК ГрафикиСотрудников
	|		ПО втЦехаБезГрафиков.Цех = ГрафикиСотрудников.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК ГрафикиЦехов
	|		ПО втЦехаБезГрафиков.Цех = ГрафикиЦехов.Цех
	|			И (НЕ &НеИспользоватьГрафикЦехов)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА втЦехаБезГрафиков.Цех ССЫЛКА Справочник.Сотрудники
	|				ТОГДА ГрафикиСотрудников.ГрафикРаботы
	|			КОГДА втЦехаБезГрафиков.Цех ССЫЛКА Справочник.Цеха
	|				ТОГДА ГрафикиЦехов.ГрафикРаботы
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЦеха.Цех КАК Цех,
	|	втЦеха.НомерЦеха КАК НомерЦеха,
	|	втЦеха.ГрафикРаботы КАК ГрафикРаботы,
	|	Календарь.ДатаКалендаря КАК Дата,
	|	ВЫБОР
	|		КОГДА НЕ ГрафикРабот.НачалоРабочегоДня ЕСТЬ NULL
	|			ТОГДА ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРабот.НачалоРабочегоДня, СЕКУНДА))
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, ЧАС, &НачалоРабочегоДня)
	|	КОНЕЦ КАК НачалоРабочегоДня,
	|	ВЫБОР
	|		КОГДА НЕ ГрафикРабот.КонецРабочегоДня ЕСТЬ NULL
	|			ТОГДА ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРабот.КонецРабочегоДня, СЕКУНДА))
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Календарь.ДатаКалендаря, ЧАС, &КонецРабочегоДня)
	|	КОНЕЦ КАК КонецРабочегоДня
	|ПОМЕСТИТЬ втКалендарь
	|ИЗ
	|	РегистрСведений.DMS_ПроизводственныйКалендарь КАК Календарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.АвтосервисГрафикРабот КАК ГрафикРабот
	|		ПО (ГрафикРабот.Ссылка = &ДилерскийЦентр)
	|			И (ДЕНЬНЕДЕЛИ(Календарь.ДатаКалендаря) = ГрафикРабот.ДеньНедели)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеха КАК втЦеха
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Календарь.ДатаКалендаря МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЦеха.Цех КАК Цех,
	|	втЦеха.НомерЦеха КАК НомерЦеха,
	|	ГрафикРаботКалендарный.Дата,
	|	ДОБАВИТЬКДАТЕ(ГрафикРаботКалендарный.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРаботКалендарный.НачалоРабочегоВремени, СЕКУНДА)) КАК НачалоРаботы,
	|	ДОБАВИТЬКДАТЕ(ГрафикРаботКалендарный.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ГрафикРаботКалендарный.КонецРабочегоВремени, СЕКУНДА)) КАК КонецРаботы
	|ПОМЕСТИТЬ втРабочееВремяИзРегистра
	|ИЗ
	|	втЦеха КАК втЦеха
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|		ПО втЦеха.ГрафикРаботы = ГрафикРаботКалендарный.График
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (ГрафикРаботКалендарный.НачалоРабочегоВремени <= &Начало
	|			ИЛИ ГрафикРаботКалендарный.КонецРабочегоВремени >= &Конец
	|			ИЛИ ГрафикРаботКалендарный.НачалоРабочегоВремени >= &Начало
	|				И ГрафикРаботКалендарный.КонецРабочегоВремени <= &Конец)
	|	И ГрафикРаботКалендарный.ВидДня = &Рабочий
	|	И ГрафикРаботКалендарный.ВидИнтервала = &ВидИнтервала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКалендарь.Цех,
	|	втКалендарь.НомерЦеха,
	|	втКалендарь.Дата,
	|	втКалендарь.НачалоРабочегоДня КАК НачалоРабочегоДня,
	|	втКалендарь.КонецРабочегоДня КАК КонецРабочегоДня,
	|	втРабочееВремя.НачалоРаботы,
	|	втРабочееВремя.КонецРаботы
	|ПОМЕСТИТЬ втРабочееВремя
	|ИЗ
	|	втКалендарь КАК втКалендарь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРабочееВремяИзРегистра КАК втРабочееВремя
	|		ПО втКалендарь.Цех = втРабочееВремя.Цех
	|			И втКалендарь.Дата = втРабочееВремя.Дата
	|			И втКалендарь.НачалоРабочегоДня < втРабочееВремя.КонецРаботы
	|			И втКалендарь.КонецРабочегоДня > втРабочееВремя.НачалоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКалендарь.Цех КАК Цех,
	|	втКалендарь.НомерЦеха КАК НомерЦеха,
	|	втКалендарь.Дата КАК Дата,
	|	втКалендарь.НачалоРабочегоДня КАК НачалоРабочегоДня,
	|	втКалендарь.КонецРабочегоДня КАК КонецРабочегоДня
	|ПОМЕСТИТЬ втНерабочиеДни
	|ИЗ
	|	втКалендарь КАК втКалендарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРабочееВремяИзРегистра КАК втРабочееВремя
	|		ПО втКалендарь.Цех = втРабочееВремя.Цех
	|			И втКалендарь.Дата = втРабочееВремя.Дата
	|ГДЕ
	|	втРабочееВремя.Дата ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеПоДням.Цех,
	|	втДанныеПоДням.НомерЦеха,
	|	втДанныеПоДням.Дата,
	|	МИНИМУМ(втДанныеПоДням.НачалоРаботы) КАК НачалоРаботы,
	|	МАКСИМУМ(втДанныеПоДням.КонецРаботы) КАК КонецРаботы
	|ПОМЕСТИТЬ втГраницыРаботы
	|ИЗ
	|	втРабочееВремя КАК втДанныеПоДням
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанныеПоДням.Цех,
	|	втДанныеПоДням.НомерЦеха,
	|	втДанныеПоДням.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втКалендарь.Цех,
	|	втКалендарь.НомерЦеха,
	|	втКалендарь.Дата КАК НачалоДня,
	|	втКалендарь.НачалоРабочегоДня КАК НачалоПростоя,
	|	втГраницыРаботы.НачалоРаботы КАК КонецПростоя
	|ПОМЕСТИТЬ втГраничныеПериодыПростоя
	|ИЗ
	|	втКалендарь КАК втКалендарь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГраницыРаботы КАК втГраницыРаботы
	|		ПО втКалендарь.Цех = втГраницыРаботы.Цех
	|			И втКалендарь.Дата = втГраницыРаботы.Дата
	|			И (втГраницыРаботы.НачалоРаботы > втКалендарь.НачалоРабочегоДня)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втКалендарь.Цех,
	|	втКалендарь.НомерЦеха,
	|	втКалендарь.Дата,
	|	втГраницыРаботы.КонецРаботы,
	|	втКалендарь.КонецРабочегоДня
	|ИЗ
	|	втКалендарь КАК втКалендарь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГраницыРаботы КАК втГраницыРаботы
	|		ПО втКалендарь.Цех = втГраницыРаботы.Цех
	|			И втКалендарь.Дата = втГраницыРаботы.Дата
	|			И втКалендарь.КонецРабочегоДня > втГраницыРаботы.КонецРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втГраничныеПериодыПростоя.Цех,
	|	втГраничныеПериодыПростоя.НомерЦеха,
	|	втГраничныеПериодыПростоя.НачалоДня КАК НачалоДня,
	|	КОНЕЦПЕРИОДА(втГраничныеПериодыПростоя.НачалоДня, ДЕНЬ) КАК КонецДня,
	|	втГраничныеПериодыПростоя.НачалоПростоя КАК ВремяНачала,
	|	втГраничныеПериодыПростоя.КонецПростоя КАК ВремяОкончания
	|ИЗ
	|	втГраничныеПериодыПростоя КАК втГраничныеПериодыПростоя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втРабочееВремя.Цех,
	|	втРабочееВремя.НомерЦеха,
	|	втРабочееВремя.Дата,
	|	КОНЕЦПЕРИОДА(втРабочееВремя.Дата, ДЕНЬ),
	|	втРабочееВремя.КонецРаботы,
	|	МИНИМУМ(втСледующийИнтервал.НачалоРаботы)
	|ИЗ
	|	втРабочееВремя КАК втРабочееВремя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРабочееВремя КАК втСледующийИнтервал
	|		ПО втРабочееВремя.Цех = втСледующийИнтервал.Цех
	|			И втРабочееВремя.Дата = втСледующийИнтервал.Дата
	|			И втРабочееВремя.КонецРаботы < втСледующийИнтервал.НачалоРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	втРабочееВремя.Цех,
	|	втРабочееВремя.НомерЦеха,
	|	втРабочееВремя.Дата,
	|	втРабочееВремя.КонецРаботы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втНерабочиеДни.Цех,
	|	втНерабочиеДни.НомерЦеха,
	|	втНерабочиеДни.Дата,
	|	КОНЕЦПЕРИОДА(втНерабочиеДни.Дата, ДЕНЬ),
	|	втНерабочиеДни.НачалоРабочегоДня,
	|	втНерабочиеДни.КонецРабочегоДня	
	|ИЗ
	|	втНерабочиеДни КАК втНерабочиеДни
	|
	|УПОРЯДОЧИТЬ ПО
	|	втГраничныеПериодыПростоя.Цех,
	|	ВремяНачала";	
	Запрос.УстановитьПараметр("ВидИнтервала", Справочники.ВидыИнтервалов.Работа);
	Запрос.УстановитьПараметр("Рабочий", Перечисления.ВидДня.Рабочий);	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ТаблицаМашиномест", ТаблицаМашиномест);
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("НеИспользоватьГрафикЦехов", ДилерскийЦентр.Автосервис_НеИспользоватьГрафикЦехов);
	
	Начало = Дата(0001, 01, 01, Час(НачалоПериода), Минута(НачалоПериода), Секунда(НачалоПериода));
	Конец = Дата(0001, 01, 01, Час(КонецПериода), Минута(КонецПериода), Секунда(КонецПериода));
	
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	Запрос.УстановитьПараметр("НачалоРабочегоДня", 8);
	Запрос.УстановитьПараметр("КонецРабочегоДня", 22);
	
	// Беседин 12.01.22 заявки 1419,1420
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Если МассивРезультатов.Получить(2).Пустой() Тогда 
		Сообщить("Не заполнен производственный календарь! Обращение создано не будет", СтатусСообщения.Внимание);
	КонецЕсли;	          
	
	Если МассивРезультатов.Получить(3).Пустой() Тогда 
		Сообщить("Не заполнен график работ календарный! Обращение создано не будет", СтатусСообщения.Внимание);
	КонецЕсли;	

	
	Таблица = МассивРезультатов.Получить(8).Выгрузить();
	//Таблица = Запрос.Выполнить().Выгрузить();  // было
	
	Таблица.Индексы.Добавить("Цех");
	
	Возврат Таблица;
	
КонецФункции

// Учитывает возможный перенос работы на следующий день.
// Считает только рабочие часы, отбрасывая время ночью
//
Функция ДлительностьРабочегоВремени(ДилерскийЦентр, ВремяНачала, ВремяОкончания) Экспорт
		
	Если НачалоДня(ВремяНачала) = НачалоДня(ВремяОкончания) Тогда
		// Это слот внутри дня
		РабочихСекунд = ВремяОкончания - ВремяНачала;
	Иначе
		РабочихСекунд = 0;
		ТекДень = НачалоДня(ВремяНачала);
		Пока ТекДень < ВремяОкончания Цикл
			ТекРабочийДень = Renault_АвтосервисПланированиеПовтИспользования.ПолучитьНачалоИКонецРабочегоДняАвтосервиса(ДилерскийЦентр, ТекДень);
			ТекВремяНачала = ?(ВремяНачала < ТекРабочийДень.ВремяНачала, ТекРабочийДень.ВремяНачала, ВремяНачала);
			ТекВремяОкончания = ?(ВремяОкончания > ТекРабочийДень.ВремяОкончания, ТекРабочийДень.ВремяОкончания, ВремяОкончания);
			РабочихСекунд = РабочихСекунд + (ТекВремяОкончания - ТекВремяНачала);
			ТекДень = ТекДень + 86400;
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат РабочихСекунд;
	
КонецФункции

// Функция возвращает время начала и окончания работы сотрудника или цеха
//
// Параметры:
//  Дата  - Дата - Дата на которую будет получено время начала и окончания
//  Объект  - СправочникСсылка.Сотрудник или СправочникСсылка.Цех - Ссылка на объект, 
//                 который необходимо получить время начало работы и окончания
//
// Возвращаемое значение:
//   Структура   - В структуру включены значения начало и окончания рабочего дня
//   //+/Блинков переписан механизм в рамках заявки DMSREN-722
Функция ПолучитьВремяРаботы(График = Неопределено, Дата= Неопределено) Экспорт
РезультатМассив = Новый Массив;
Если График = Неопределено или Дата= Неопределено Тогда
	Возврат (РезультатМассив);
КонецЕсли; 

ГрафикРаботы = РегистрыСведений.ГрафикРаботКалендарный;
НаборГрафикРаботы = ГрафикРаботы.СоздатьНаборЗаписей();
НаборГрафикРаботы.Отбор.Дата.Установить(Дата);
НаборГрафикРаботы.Отбор.График.Установить(График);
НаборГрафикРаботы.Прочитать();
ПустаяДата = '00010101000000';
Для Каждого Запись из НаборГрафикРаботы Цикл 
	Результат = Новый Структура("ВремяНачало,ВремяОкончание,ДатаВыбора,РабочийДень,ВидИнтервала"); 
	Результат.ДатаВыбора  = Запись.Дата;
	Результат.ВремяНачало = ПустаяДата + (Результат.ДатаВыбора - ПустаяДата) + (Запись.НачалоРабочегоВремени - ПустаяДата);
	Результат.ВремяОкончание =  ПустаяДата + (Результат.ДатаВыбора - ПустаяДата) + (Запись.КонецРабочегоВремени - ПустаяДата);
	Результат.ВидИнтервала =  Запись.ВидИнтервала;
	Результат.РабочийДень  = Запись.ВидДня;
	РезультатМассив.Добавить(Результат);
КонецЦикла;
Возврат(РезультатМассив);

КонецФункции // ПолучитьВремяРаботы() //+/Блинков переписан механизм в рамках заявки DMSREN-722
